Repository: jeronimo-molina/bulb-app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es, pt

source: Wet Bulb Temperature
es: Temperatura de bulbo húmedo
pt: Temperatura de bulbo úmido

source: Wet Bulb Temperature Calculator
es: Calculadora de temperatura de bulbo húmedo
pt: Calculadora de temperatura de bulbo úmido

source: Choose your language:
es: Seleccione su idioma:
pt: Escolha seu idioma:

source: City:
es: Ciudad:
pt: Cidade:

source: Enter city name
pt: Digite o nome da cidade

source: Get Wet Bulb Temperature
es: Obtener temperatura de bulbo húmedo
pt: Obter temperatura de bulbo úmido

source: Results for
es: Resultados para
pt: Resultados para

source: Temperature:
es: Temperatura:
pt: Temperatura:

source: Humidity:
es: Humedad:
pt: Umidade:

source: Wet Bulb Temperature:
es: Temperatura de bulbo húmedo:
pt: Temperatura de bulbo úmido:

source: Life risk! Seek an air-conditioned place immediately!
es: ¡Peligro de muerte! ¡Busque un lugar con aire acondicionado de inmediato!
pt: Risco de vida! Procure um lugar com ar condicionado imediatamente!

source: Danger! Seek an air-conditioned place. Risk of life for sensitive people.
es: ¡Peligro! Busque un lugar con aire acondicionado. Riesgo de muerte para personas sensibles.
pt: Perigo! Procure um local com ar condicionado. Risco de vida para pessoas sensíveis.

source: Alert! Look for a cool place.
es: ¡Alerta! Busca un lugar fresco.
pt: Alerta! Procure um lugar fresco.

source: Normal temperature.
es: Temperatura normal.
pt: Temperatura normal.

source: Error:
pt: Erro:

source: What is Wet Bulb Temperature?
es: ¿Qué es la temperatura de bulbo húmedo?
pt: O que é temperatura de bulbo úmido?

source: The wet bulb temperature is the temperature measured by a thermometer whose bulb (the sensitive part) is wrapped in a wet cloth. This temperature reflects the amount of moisture in the air, as the evaporation of water from the cloth cools the thermometer.
es: La temperatura de bulbo húmedo es la temperatura que se mide con un termómetro cuyo bulbo (la parte sensible) está envuelto en un paño húmedo. Esta temperatura refleja la cantidad de humedad en el aire, ya que la evaporación del agua del paño enfría el termómetro.
pt: A temperatura de bulbo úmido é a temperatura medida por um termômetro cujo bulbo (a parte sensível) está envolto em um pano molhado. Essa temperatura reflete a quantidade de umidade no ar, pois a evaporação da água do pano resfria o termômetro.

source: What is its use?
es: ¿Cual es su utilidad?
pt: Qual é a sua utilidade?

source: Wet bulb temperature is crucial for understanding thermal comfort in environments. When the relative humidity is high, the evaporation of sweat from the human body decreases, making the perceived temperature feel hotter. In extreme cases, when the wet bulb temperature is too high, the body may struggle to cool down effectively, which can be dangerous.
es: La temperatura de bulbo húmedo es fundamental para comprender el confort térmico en los entornos. Cuando la humedad relativa es alta, la evaporación del sudor del cuerpo humano disminuye, lo que hace que la temperatura percibida se sienta más alta. En casos extremos, cuando la temperatura de bulbo húmedo es demasiado alta, el cuerpo puede tener dificultades para enfriarse de manera efectiva, lo que puede ser peligroso.
pt: A temperatura de bulbo úmido é crucial para entender o conforto térmico em ambientes. Quando a umidade relativa é alta, a evaporação do suor do corpo humano diminui, fazendo com que a temperatura percebida pareça mais quente. Em casos extremos, quando a temperatura de bulbo úmido é muito alta, o corpo pode ter dificuldade para resfriar de forma eficaz, o que pode ser perigoso.

source: Reference
es: Referencia
pt: Referência

source: We use cookies to ensure you get the best experience on our website.
es: Utilizamos cookies para garantizar que obtenga la mejor experiencia en nuestro sitio web.
pt: Usamos cookies para garantir que você tenha a melhor experiência em nosso site.

source: Accept
es: Aceptar
pt: Aceitar
